georgik/swift-xtensa/esp32s3-swift-test/sdkconfig.defaults
# Target configuration
CONFIG_IDF_TARGET_ESP32S3=y
CONFIG_IDF_TARGET="esp32s3"

# Performance optimizations
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y

# Memory configuration
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# Linker configuration for Swift
CONFIG_LINKER_ORPHAN_HANDLING_PLACE=y

# Enable atomic operations support
CONFIG_COMPILER_WARN_WRITE_STRINGS=y
